//HC25 库

#include "string.h"

#include "systick.h"

#include "led.h"

#include "hc25.h"

/**************************************** 私有变量 ****************************************/

uint8_t is_at_mode = 1; //开机时默认 AT 模式打开，防止出错
uint8_t at_cmd[30];

/*****************************************************************************************/

/**************************************** 私有函数 ****************************************/

/*****************************************************************************************/

void HC25_Init(void)
{
    HC25_ExitATMode;
}

void HC25_SendATCmd(uint8_t *cmd)
{
    strcpy(at_cmd, "AT+");
    strcat(at_cmd, cmd);
    HC25_SendBuff(at_cmd, strlen(at_cmd) + 1);
}
